import s from "./rules.module.scss";
import ArrowIcon from "@/assets/images/icons/arrow.svg";
import { useRouter } from "next/router";

export default function Rules() {
  const navigate = useRouter();

  return (
    <div className={s.rules}>
      <div className="container">
        <h1 onClick={() => navigate.back()}>
          <ArrowIcon />
          Пользовательское соглашение
        </h1>
        <h3>1. Общие положения</h3>
        <ul>
          <li>
            1.1. ООО «ЯНДЕКС» (далее — «Яндекс») предлагает пользователю сети
            Интернет (далее – Пользователь) - использовать свои сервисы на
            условиях, изложенных в настоящем Пользовательском соглашении (далее
            — «Соглашение», «ПС»). Соглашение вступает в силу с момента
            выражения Пользователем согласия с его условиями в порядке,
            предусмотренном п. 1.4 Соглашения.
          </li>
          <li>
            1.2. Яндекс предлагает Пользователям доступ к широкому спектру
            сервисов, включая средства навигации, коммуникации, поиска,
            размещения и хранения разного рода информации и материалов
            (контента), персонализации контента, совершения покупок и т. д. Все
            существующие на данный момент сервисы ООО «ЯНДЕКС» и других
            компаний, условия использования которых ссылаются на данное
            Соглашение, а также любое развитие их и/или добавление новых
            является предметом настоящего Соглашения.
          </li>
          <li>
            1.3. Использование сервисов Яндекса регулируется настоящим
            Соглашением, а также следующими документами, которые являются
            неотъемлемой частью настоящего соглашения:
          </li>
        </ul>
        <h3>1. Общие положения</h3>
        <ul>
          <li>
            1.1. ООО «ЯНДЕКС» (далее — «Яндекс») предлагает пользователю сети
            Интернет (далее – Пользователь) - использовать свои сервисы на
            условиях, изложенных в настоящем Пользовательском соглашении (далее
            — «Соглашение», «ПС»). Соглашение вступает в силу с момента
            выражения Пользователем согласия с его условиями в порядке,
            предусмотренном п. 1.4 Соглашения.
          </li>
          <li>
            1.2. Яндекс предлагает Пользователям доступ к широкому спектру
            сервисов, включая средства навигации, коммуникации, поиска,
            размещения и хранения разного рода информации и материалов
            (контента), персонализации контента, совершения покупок и т. д. Все
            существующие на данный момент сервисы ООО «ЯНДЕКС» и других
            компаний, условия использования которых ссылаются на данное
            Соглашение, а также любое развитие их и/или добавление новых
            является предметом настоящего Соглашения.
          </li>
          <li>
            1.3. Использование сервисов Яндекса регулируется настоящим
            Соглашением, а также следующими документами, которые являются
            неотъемлемой частью настоящего соглашения:
          </li>
        </ul>
        <h3>1. Общие положения</h3>
        <ul>
          <li>
            1.1. ООО «ЯНДЕКС» (далее — «Яндекс») предлагает пользователю сети
            Интернет (далее – Пользователь) - использовать свои сервисы на
            условиях, изложенных в настоящем Пользовательском соглашении (далее
            — «Соглашение», «ПС»). Соглашение вступает в силу с момента
            выражения Пользователем согласия с его условиями в порядке,
            предусмотренном п. 1.4 Соглашения.
          </li>
          <li>
            1.2. Яндекс предлагает Пользователям доступ к широкому спектру
            сервисов, включая средства навигации, коммуникации, поиска,
            размещения и хранения разного рода информации и материалов
            (контента), персонализации контента, совершения покупок и т. д. Все
            существующие на данный момент сервисы ООО «ЯНДЕКС» и других
            компаний, условия использования которых ссылаются на данное
            Соглашение, а также любое развитие их и/или добавление новых
            является предметом настоящего Соглашения.
          </li>
          <li>
            1.3. Использование сервисов Яндекса регулируется настоящим
            Соглашением, а также следующими документами, которые являются
            неотъемлемой частью настоящего соглашения:
          </li>
        </ul>
        <h3>1. Общие положения</h3>
        <ul>
          <li>
            1.1. ООО «ЯНДЕКС» (далее — «Яндекс») предлагает пользователю сети
            Интернет (далее – Пользователь) - использовать свои сервисы на
            условиях, изложенных в настоящем Пользовательском соглашении (далее
            — «Соглашение», «ПС»). Соглашение вступает в силу с момента
            выражения Пользователем согласия с его условиями в порядке,
            предусмотренном п. 1.4 Соглашения.
          </li>
          <li>
            1.2. Яндекс предлагает Пользователям доступ к широкому спектру
            сервисов, включая средства навигации, коммуникации, поиска,
            размещения и хранения разного рода информации и материалов
            (контента), персонализации контента, совершения покупок и т. д. Все
            существующие на данный момент сервисы ООО «ЯНДЕКС» и других
            компаний, условия использования которых ссылаются на данное
            Соглашение, а также любое развитие их и/или добавление новых
            является предметом настоящего Соглашения.
          </li>
          <li>
            1.3. Использование сервисов Яндекса регулируется настоящим
            Соглашением, а также следующими документами, которые являются
            неотъемлемой частью настоящего соглашения:
          </li>
        </ul>
        <h3>1. Общие положения</h3>
        <ul>
          <li>
            1.1. ООО «ЯНДЕКС» (далее — «Яндекс») предлагает пользователю сети
            Интернет (далее – Пользователь) - использовать свои сервисы на
            условиях, изложенных в настоящем Пользовательском соглашении (далее
            — «Соглашение», «ПС»). Соглашение вступает в силу с момента
            выражения Пользователем согласия с его условиями в порядке,
            предусмотренном п. 1.4 Соглашения.
          </li>
          <li>
            1.2. Яндекс предлагает Пользователям доступ к широкому спектру
            сервисов, включая средства навигации, коммуникации, поиска,
            размещения и хранения разного рода информации и материалов
            (контента), персонализации контента, совершения покупок и т. д. Все
            существующие на данный момент сервисы ООО «ЯНДЕКС» и других
            компаний, условия использования которых ссылаются на данное
            Соглашение, а также любое развитие их и/или добавление новых
            является предметом настоящего Соглашения.
          </li>
          <li>
            1.3. Использование сервисов Яндекса регулируется настоящим
            Соглашением, а также следующими документами, которые являются
            неотъемлемой частью настоящего соглашения:
          </li>
        </ul>
        <ul>
          <li>
            1.1. ООО «ЯНДЕКС» (далее — «Яндекс») предлагает пользователю сети
            Интернет (далее – Пользователь) - использовать свои сервисы на
            условиях, изложенных в настоящем Пользовательском соглашении (далее
            — «Соглашение», «ПС»). Соглашение вступает в силу с момента
            выражения Пользователем согласия с его условиями в порядке,
            предусмотренном п. 1.4 Соглашения.
          </li>
          <li>
            1.2. Яндекс предлагает Пользователям доступ к широкому спектру
            сервисов, включая средства навигации, коммуникации, поиска,
            размещения и хранения разного рода информации и материалов
            (контента), персонализации контента, совершения покупок и т. д. Все
            существующие на данный момент сервисы ООО «ЯНДЕКС» и других
            компаний, условия использования которых ссылаются на данное
            Соглашение, а также любое развитие их и/или добавление новых
            является предметом настоящего Соглашения.
          </li>
          <li>
            1.3. Использование сервисов Яндекса регулируется настоящим
            Соглашением, а также следующими документами, которые являются
            неотъемлемой частью настоящего соглашения:
          </li>
        </ul>
        <h3>1. Общие положения</h3>
        <ul>
          <li>
            1.1. ООО «ЯНДЕКС» (далее — «Яндекс») предлагает пользователю сети
            Интернет (далее – Пользователь) - использовать свои сервисы на
            условиях, изложенных в настоящем Пользовательском соглашении (далее
            — «Соглашение», «ПС»). Соглашение вступает в силу с момента
            выражения Пользователем согласия с его условиями в порядке,
            предусмотренном п. 1.4 Соглашения.
          </li>
          <li>
            1.2. Яндекс предлагает Пользователям доступ к широкому спектру
            сервисов, включая средства навигации, коммуникации, поиска,
            размещения и хранения разного рода информации и материалов
            (контента), персонализации контента, совершения покупок и т. д. Все
            существующие на данный момент сервисы ООО «ЯНДЕКС» и других
            компаний, условия использования которых ссылаются на данное
            Соглашение, а также любое развитие их и/или добавление новых
            является предметом настоящего Соглашения.
          </li>
          <li>
            1.3. Использование сервисов Яндекса регулируется настоящим
            Соглашением, а также следующими документами, которые являются
            неотъемлемой частью настоящего соглашения:
          </li>
        </ul>
        <h3>1. Общие положения</h3>
        <ul>
          <li>
            1.1. ООО «ЯНДЕКС» (далее — «Яндекс») предлагает пользователю сети
            Интернет (далее – Пользователь) - использовать свои сервисы на
            условиях, изложенных в настоящем Пользовательском соглашении (далее
            — «Соглашение», «ПС»). Соглашение вступает в силу с момента
            выражения Пользователем согласия с его условиями в порядке,
            предусмотренном п. 1.4 Соглашения.
          </li>
          <li>
            1.2. Яндекс предлагает Пользователям доступ к широкому спектру
            сервисов, включая средства навигации, коммуникации, поиска,
            размещения и хранения разного рода информации и материалов
            (контента), персонализации контента, совершения покупок и т. д. Все
            существующие на данный момент сервисы ООО «ЯНДЕКС» и других
            компаний, условия использования которых ссылаются на данное
            Соглашение, а также любое развитие их и/или добавление новых
            является предметом настоящего Соглашения.
          </li>
          <li>
            1.3. Использование сервисов Яндекса регулируется настоящим
            Соглашением, а также следующими документами, которые являются
            неотъемлемой частью настоящего соглашения:
          </li>
        </ul>
        <h3>1. Общие положения</h3>
        <ul>
          <li>
            1.1. ООО «ЯНДЕКС» (далее — «Яндекс») предлагает пользователю сети
            Интернет (далее – Пользователь) - использовать свои сервисы на
            условиях, изложенных в настоящем Пользовательском соглашении (далее
            — «Соглашение», «ПС»). Соглашение вступает в силу с момента
            выражения Пользователем согласия с его условиями в порядке,
            предусмотренном п. 1.4 Соглашения.
          </li>
          <li>
            1.2. Яндекс предлагает Пользователям доступ к широкому спектру
            сервисов, включая средства навигации, коммуникации, поиска,
            размещения и хранения разного рода информации и материалов
            (контента), персонализации контента, совершения покупок и т. д. Все
            существующие на данный момент сервисы ООО «ЯНДЕКС» и других
            компаний, условия использования которых ссылаются на данное
            Соглашение, а также любое развитие их и/или добавление новых
            является предметом настоящего Соглашения.
          </li>
          <li>
            1.3. Использование сервисов Яндекса регулируется настоящим
            Соглашением, а также следующими документами, которые являются
            неотъемлемой частью настоящего соглашения:
          </li>
        </ul>
        <h3>1. Общие положения</h3>
        <ul>
          <li>
            1.1. ООО «ЯНДЕКС» (далее — «Яндекс») предлагает пользователю сети
            Интернет (далее – Пользователь) - использовать свои сервисы на
            условиях, изложенных в настоящем Пользовательском соглашении (далее
            — «Соглашение», «ПС»). Соглашение вступает в силу с момента
            выражения Пользователем согласия с его условиями в порядке,
            предусмотренном п. 1.4 Соглашения.
          </li>
          <li>
            1.2. Яндекс предлагает Пользователям доступ к широкому спектру
            сервисов, включая средства навигации, коммуникации, поиска,
            размещения и хранения разного рода информации и материалов
            (контента), персонализации контента, совершения покупок и т. д. Все
            существующие на данный момент сервисы ООО «ЯНДЕКС» и других
            компаний, условия использования которых ссылаются на данное
            Соглашение, а также любое развитие их и/или добавление новых
            является предметом настоящего Соглашения.
          </li>
          <li>
            1.3. Использование сервисов Яндекса регулируется настоящим
            Соглашением, а также следующими документами, которые являются
            неотъемлемой частью настоящего соглашения:
          </li>
        </ul>
      </div>
    </div>
  );
}
