import ArrowIcon from "@/assets/images/icons/arrow.svg";
import { useRouter } from "next/router";
import s from "./confidential.module.scss";

export default function Confidential() {
  const navigate = useRouter();

  return (
    <div className={s.confidential}>
      <div className="container">
        <h1 onClick={() => navigate.back()}>
          <ArrowIcon />
          Политика конфиденциальности
        </h1>
        <h3>1. Что регулирует настоящая политика конфиденциальности</h3>
        <p>
          Настоящая политика конфиденциальности (далее — Политика) действует в
          отношении всей информации, включая персональные данные в понимании
          применимого законодательства (далее — «Персональная информация»),
          которую ООО «ЯНДЕКС» и/или его аффилированные лица, в том числе
          входящие в одну группу с ООО «ЯНДЕКС» (далее — «Яндекс»), могут
          получить о Вас в процессе использования Вами любых сайтов, программ,
          продуктов и/или сервисов Яндекса (далее вместе — «Сервисы»),
          информацию о которых Вы можете найти на сайтах yandex.ru, yandex.com,
          yandex.ua, yandex.by, yandex.kz, yandex.com.tr, yandex.co.il и других
          принадлежащих Яндексу сайтах (далее вместе — «Сайты»), а также в ходе
          исполнения Яндексом / его аффилированными лицами любых соглашений и
          договоров, заключенных с Вами в связи с использованием Вами Сервисов.
          Яндекс может также получать Персональную информацию от своих партнеров
          (далее — «Партнеры»), сайты, программы, продукты или сервисы которых
          Вы используете (например, от рекламодателей Яндекса или служб такси)
          из других источников с общедоступными
        </p>
        <h3>1. Что регулирует настоящая политика конфиденциальности</h3>
        <p>
          Настоящая политика конфиденциальности (далее — Политика) действует в
          отношении всей информации, включая персональные данные в понимании
          применимого законодательства (далее — «Персональная информация»),
          которую ООО «ЯНДЕКС» и/или его аффилированные лица, в том числе
          входящие в одну группу с ООО «ЯНДЕКС» (далее — «Яндекс»), могут
          получить о Вас в процессе использования Вами любых сайтов, программ,
          продуктов и/или сервисов Яндекса (далее вместе — «Сервисы»),
          информацию о которых Вы можете найти на сайтах yandex.ru, yandex.com,
          yandex.ua, yandex.by, yandex.kz, yandex.com.tr, yandex.co.il и других
          принадлежащих Яндексу сайтах (далее вместе — «Сайты»), а также в ходе
          исполнения Яндексом / его аффилированными лицами любых соглашений и
          договоров, заключенных с Вами в связи с использованием Вами Сервисов.
          Яндекс может также получать Персональную информацию от своих партнеров
          (далее — «Партнеры»), сайты, программы, продукты или сервисы которых
          Вы используете (например, от рекламодателей Яндекса или служб такси)
          из других источников с общедоступными
        </p>
        <h3>1. Что регулирует настоящая политика конфиденциальности</h3>
        <p>
          Настоящая политика конфиденциальности (далее — Политика) действует в
          отношении всей информации, включая персональные данные в понимании
          применимого законодательства (далее — «Персональная информация»),
          которую ООО «ЯНДЕКС» и/или его аффилированные лица, в том числе
          входящие в одну группу с ООО «ЯНДЕКС» (далее — «Яндекс»), могут
          получить о Вас в процессе использования Вами любых сайтов, программ,
          продуктов и/или сервисов Яндекса (далее вместе — «Сервисы»),
          информацию о которых Вы можете найти на сайтах yandex.ru, yandex.com,
          yandex.ua, yandex.by, yandex.kz, yandex.com.tr, yandex.co.il и других
          принадлежащих Яндексу сайтах (далее вместе — «Сайты»), а также в ходе
          исполнения Яндексом / его аффилированными лицами любых соглашений и
          договоров, заключенных с Вами в связи с использованием Вами Сервисов.
          Яндекс может также получать Персональную информацию от своих партнеров
          (далее — «Партнеры»), сайты, программы, продукты или сервисы которых
          Вы используете (например, от рекламодателей Яндекса или служб такси)
          из других источников с общедоступными
        </p>
        <h3>1. Что регулирует настоящая политика конфиденциальности</h3>
        <p>
          Настоящая политика конфиденциальности (далее — Политика) действует в
          отношении всей информации, включая персональные данные в понимании
          применимого законодательства (далее — «Персональная информация»),
          которую ООО «ЯНДЕКС» и/или его аффилированные лица, в том числе
          входящие в одну группу с ООО «ЯНДЕКС» (далее — «Яндекс»), могут
          получить о Вас в процессе использования Вами любых сайтов, программ,
          продуктов и/или сервисов Яндекса (далее вместе — «Сервисы»),
          информацию о которых Вы можете найти на сайтах yandex.ru, yandex.com,
          yandex.ua, yandex.by, yandex.kz, yandex.com.tr, yandex.co.il и других
          принадлежащих Яндексу сайтах (далее вместе — «Сайты»), а также в ходе
          исполнения Яндексом / его аффилированными лицами любых соглашений и
          договоров, заключенных с Вами в связи с использованием Вами Сервисов.
          Яндекс может также получать Персональную информацию от своих партнеров
          (далее — «Партнеры»), сайты, программы, продукты или сервисы которых
          Вы используете (например, от рекламодателей Яндекса или служб такси)
          из других источников с общедоступными
        </p>
      </div>
    </div>
  );
};
